pycon-2016-prop-test/property-testing-hypothesis.org
#+STARTUP: indent
#+Title: Don't write tests, Generate them!
#+Author: Puneeth Chaganti
#+Email: punchagan@muse-amuse.in

#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:nil ^:{}
#+OPTIONS: reveal_mathjax:t reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1200 reveal_height:800
#+OPTIONS: toc:1
#+REVEAL_MARGIN: 0
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 5
#+REVEAL_TRANS: cube
#+REVEAL_THEME: solarized
#+REVEAL_HLEVEL: 2
#+REVEAL_PLUGINS: (highlight notes multiplex)

# #+REVEAL_ROOT: https://cdn.jsdelivr.net/reveal.js/3.0.0/
#+REVEAL_ROOT: reveal.js/

* Introduction
** TODO Have things working with no internet
- [ ] Have a backup local copy of slides
- [X] Slides should work with local copy of reveal.js
  - [X] Figure out install, running, etc.
  - [X] Fix broken fonts!
- [X] Speaker notes should work
** Testing, anyone?
#+BEGIN_NOTES
- Do you TDD?
- Do you have a large test-suite?
- Testing excites you?
- Testing is tedious and painful?
- Testing is a waste!
#+END_NOTES
** Property-based testing, anyone?
#+BEGIN_NOTES
- QuickCheck?
- Property based testing?
- Hypothesis?
- This talk will:
  - give an overview of PBT
  - Hypothesis overview
  - Use extremely simple examples
  - hopefully excite you to learn more and try it out!
#+END_NOTES
** Example based tests
- Given :: Setup some *example* data
- When :: Perform actions
- Then :: ~assert output == expected~

#+BEGIN_NOTES
- How?
  - Start off with example inputs
    - clever examples, edge cases
  - Think about example outputs
  - Write and run tests
  - Easy to think in terms of examples

- Good to
  - Catch regressions
  - no test -> tests, give confidence
  - A loose specification of the code
    - we can interpolate

- BDD Keywords, but unit-tests do the same thing
#+END_NOTES

** Problems?
#+BEGIN_SRC python
  my_strip = lambda x, y: x.strip(y)

  def test_whitespace_strip():
      s = ' foo  '
      assert my_strip(s, ' ') == 'foo'


  def test_strip_empty():
      s = ''
      assert my_strip(s, ' ') == ''


  def test_strip():
      s = 'foo'
      assert my_strip(s, 'fo') == ''
#+END_SRC
#+BEGIN_NOTES
- Combinatorial explosion!
  - Humans aren't good at enumerating everything
- Developer biases
  - How often have you missed bugs because test code = dev code?
  - Why do we have other people writing tests?
- Tedious
  - How often have you removed/not updated tests?
  - Hard to write and *maintain*!!
    - one change you've to go and fix all the tests
    - say you decide to remove one arg
#+END_NOTES

** How to fix them?

Property-based testing

(Generative testing)

#+BEGIN_NOTES
- Randomly generated inputs
  - Less tedious
  - Address combinatorial explosion
  - Biases
- Automate everything, even generation of tests!
#+END_NOTES

*** Make it a property based test!
#+BEGIN_SRC python
  import string, random

  def random_string():
      n = random.randint(0, 10)
      return ''.join(random.choice(string.printable) for _ in range(n))

  def test_strip_hyp():
      for _ in range(200):
          s = random_string()
          strip_chars = random_string()

          S = my_strip(s)

          assert len(S) <= len(s)
          if len(S) > 0:
              assert S[0] not in set(strip_chars)
              assert S[-1] not in set(strip_chars)
#+END_SRC

#+BEGIN_NOTES
- You don't really need a library
- But, a library can make life easy!
  - Randomness can be hard
    - minimal example
    - repeatability of tests
  - You are writing your generator
#+END_NOTES

*** Property based tests
- Given :: For *random* data matching a spec
- When :: Perform actions
- Then :: ~assert property(output)~

#+BEGIN_NOTES
- Why properties?
  - Don't know the exact output, so can't check actual vs. expected
  - Loose assertions, but better spec
  - Force us to think harder
#+END_NOTES

* Hypothesis - Property based testing for Python
** Hypothesized test
#+BEGIN_SRC python
  from hypothesis import given, strategies as st

  @given(st.text(), st.text())
  def test_strip_hypothesis(s, strip_chars):
      S = my_strip(s, strip_chars)
      assert len(S) <= len(s)
      if len(S) > 0:
          assert S[0] not in set(strip_chars)
          assert S[-1] not in set(strip_chars)

  # Ran 1 test in 0.159s
#+END_SRC

#+BEGIN_NOTES
- Parametrized tests similar to py.test
- Random inputs for parameters
- Overflow
#+END_NOTES
*** Failing output
#+BEGIN_SRC text
  s = '01', strip_chars = '1'

      @given(st.text(), st.text())
      def test_strip_hyp(s, strip_chars):
          my_strip = lambda x, y: x.lstrip(y)
          # print('s: {}, strip_chars: {}'.format(repr(s), repr(strip_chars)))
          S = my_strip(s, strip_chars)
          assert len(S) <= len(s)
          if len(S) > 0:
              assert S[0] not in set(strip_chars)
  >           assert S[-1] not in set(strip_chars)
  E           assert '1' not in {'1'}
  E            +  where {'1'} = set('1')

  test_code.py:118: AssertionError
  ----------------------------------------------------- Hypothesis ------------------------------------------------------
  Falsifying example: test_strip_hyp(s='01', strip_chars='1')
#+END_SRC

** What is Hypothesis?
- a modern implementation of property based testing
- Plans for Java/C/C++ version
- ~pip install hypothesis~
#+BEGIN_NOTES
- David MacIver
- Training
- Funding
#+END_NOTES
*** What does it provide?
- Data generation
- Test properties & record failures
- Shrinking
- Configurable
#+BEGIN_NOTES
- a bunch of strategies to generate different kinds of data!
- Hook up to testing frameworks for asserting properties
- recording inputs for failed tests
- shrinking them
#+END_NOTES

** Data generation
