pycon-2016-prop-test/property-testing-hypothesis.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Don't write tests, Generate them!</title>
<meta name="author" content="(Puneeth Chaganti)"/>
<link rel="stylesheet" href="reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="reveal.js/css/theme/solarized.css" id="theme"/>

<link rel="stylesheet" href="reveal.js/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Don't write tests, Generate them!</h1><h2 class="author">Puneeth Chaganti</h2><p class="date">Created: 2016-09-23 Fri 03:07</p>
</section>
<section id="table-of-contents">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#/slide-orgfa4177d">Introduction</a></li>
<li><a href="#/slide-orge48a917">Hypothesis - Property based testing for Python</a></li>
<li><a href="#/slide-org5e9041f">How-to write properties?</a></li>
<li><a href="#/slide-org250da45"><span class="todo TODO">TODO</span> Stateful testing??</a></li>
<li><a href="#/slide-orgc021a84"><span class="todo TODO">TODO</span> Common pitfalls</a></li>
<li><a href="#/slide-org63b1d8f">Conclusion</a></li>
</ul>
</div>
</div>
</section>

<section>
<section id="slide-orgfa4177d">
<h2 id="orgfa4177d">Introduction</h2>
<div class="outline-text-2" id="text-orgfa4177d">
</div></section>
</section>
<section>
<section id="slide-org8bcde54">
<h3 id="org8bcde54"><span class="todo TODO">TODO</span> Have things working with no internet</h3>
<ul>
<li class="off"><code>[&#xa0;]</code> Have a backup local copy of slides</li>
<li class="on"><code>[X]</code> Slides should work with local copy of reveal.js
<ul>
<li class="on"><code>[X]</code> Figure out install, running, etc.</li>
<li class="on"><code>[X]</code> Fix broken fonts!</li>

</ul></li>
<li class="on"><code>[X]</code> Speaker notes should work</li>

</ul>
</section>
</section>
<section>
<section id="slide-org5895074">
<h3 id="org5895074">Testing, anyone?</h3>
<aside class="notes">
<ul>
<li>Do you TDD?</li>
<li>Do you have a large test-suite?</li>
<li>Testing excites you?</li>
<li>Testing is tedious and painful?</li>
<li>Testing is a waste!</li>

</ul>

</aside>
</section>
</section>
<section>
<section id="slide-org243050f">
<h3 id="org243050f">Property-based testing, anyone?</h3>
<aside class="notes">
<ul>
<li>QuickCheck?</li>
<li>Property based testing?</li>
<li>Hypothesis?</li>
<li>This talk will:
<ul>
<li>give an overview of PBT</li>
<li>Hypothesis overview</li>
<li>Use extremely simple examples</li>
<li>hopefully excite you to learn more and try it out!</li>

</ul></li>

</ul>

</aside>
</section>
</section>
<section>
<section id="slide-org4f01f43">
<h3 id="org4f01f43">Example based tests</h3>
<dl>
<dt>Given</dt><dd>Setup some <b>example</b> data</dd>
<dt>When</dt><dd>Perform actions</dd>
<dt>Then</dt><dd><code>assert output == expected</code></dd>

</dl>

<aside class="notes">
<ul>
<li>How?
<ul>
<li>Start off with example inputs
<ul>
<li>clever examples, edge cases</li>

</ul></li>
<li>Think about example outputs</li>
<li>Write and run tests</li>
<li>Easy to think in terms of examples</li>

</ul></li>

<li>Good to
<ul>
<li>Catch regressions</li>
<li>no test -&gt; tests, give confidence</li>
<li>A loose specification of the code
<ul>
<li>we can interpolate</li>

</ul></li>

</ul></li>

<li>BDD Keywords, but unit-tests do the same thing</li>

</ul>

</aside>

</section>
</section>
<section>
<section id="slide-org1176212">
<h3 id="org1176212">Problems?</h3>
<div class="org-src-container">

<pre><code class="python" >my_strip = lambda x, y: x.strip(y)

def test_whitespace_strip():
    s = ' foo  '
    assert my_strip(s, ' ') == 'foo'


def test_strip_empty():
    s = ''
    assert my_strip(s, ' ') == ''


def test_strip():
    s = 'foo'
    assert my_strip(s, 'fo') == ''
</code></pre>
</div>
<aside class="notes">
<ul>
<li>Combinatorial explosion!
<ul>
<li>Humans aren't good at enumerating everything</li>

</ul></li>
<li>Developer biases
<ul>
<li>How often have you missed bugs because test code = dev code?</li>
<li>Why do we have other people writing tests?</li>

</ul></li>
<li>Tedious
<ul>
<li>How often have you removed/not updated tests?</li>
<li>Hard to write and <b>maintain</b>!!
<ul>
<li>one change you've to go and fix all the tests</li>
<li>say you decide to remove one arg</li>

</ul></li>

</ul></li>

</ul>

</aside>

</section>
</section>
<section>
<section id="slide-org744afbc">
<h3 id="org744afbc">How to fix them?</h3>
<p>
Property-based testing
</p>

<p>
(Generative testing)
</p>

<aside class="notes">
<ul>
<li>Randomly generated inputs
<ul>
<li>Less tedious</li>
<li>Address combinatorial explosion</li>
<li>Biases</li>

</ul></li>
<li>Automate everything, even generation of tests!</li>

</ul>

</aside>

</section>
<section id="slide-orgb6237b4">
<h4 id="orgb6237b4">Make it a property based test!</h4>
<div class="org-src-container">

<pre><code class="python" >import string, random

def random_string():
    n = random.randint(0, 10)
    return ''.join(random.choice(string.printable) for _ in range(n))

def test_strip_hyp():
    for _ in range(200):
        s = random_string()
        strip_chars = random_string()

        S = my_strip(s)

        assert len(S) <= len(s)
        if len(S) > 0:
            assert S[0] not in set(strip_chars)
            assert S[-1] not in set(strip_chars)
</code></pre>
</div>

<aside class="notes">
<ul>
<li>You don't really need a library</li>
<li>But, a library can make life easy!
<ul>
<li>Randomness can be hard
<ul>
<li>minimal example</li>
<li>repeatability of tests</li>

</ul></li>
<li>You are writing your generator</li>

</ul></li>

</ul>

</aside>

</section>
<section id="slide-orgd2e915c">
<h4 id="orgd2e915c">Property based tests</h4>
<dl>
<dt>Given</dt><dd>For <b>random</b> data matching a spec</dd>
<dt>When</dt><dd>Perform actions</dd>
<dt>Then</dt><dd><code>assert property(output)</code></dd>

</dl>

<aside class="notes">
<ul>
<li>Why properties?
<ul>
<li>Don't know the exact output, so can't check actual vs. expected</li>
<li>Loose assertions, but better spec</li>
<li>Force us to think harder</li>

</ul></li>

</ul>

</aside>

</section>
</section>
<section>
<section id="slide-orge48a917">
<h2 id="orge48a917">Hypothesis - Property based testing for Python</h2>
<div class="outline-text-2" id="text-orge48a917">
</div></section>
</section>
<section>
<section id="slide-org7f25868">
<h3 id="org7f25868">Hypothesized test</h3>
<div class="org-src-container">

<pre><code class="python" >from hypothesis import given, strategies as st

@given(st.text(), st.text())
def test_strip_hypothesis(s, strip_chars):
    S = my_strip(s, strip_chars)
    assert len(S) <= len(s)
    if len(S) > 0:
        assert S[0] not in set(strip_chars)
        assert S[-1] not in set(strip_chars)

# Ran 1 test in 0.159s
</code></pre>
</div>

<aside class="notes">
<ul>
<li>Parametrized tests similar to py.test</li>
<li>Random inputs for parameters</li>
<li>Overflow</li>

</ul>

</aside>
</section>
<section id="slide-org7118854">
<h4 id="org7118854">Failing output</h4>
<div class="org-src-container">

<pre><code class="text" >s = '01', strip_chars = '1'

    @given(st.text(), st.text())
    def test_strip_hyp(s, strip_chars):
        my_strip = lambda x, y: x.lstrip(y)
        # print('s: {}, strip_chars: {}'.format(repr(s), repr(strip_chars)))
        S = my_strip(s, strip_chars)
        assert len(S) <= len(s)
        if len(S) > 0:
            assert S[0] not in set(strip_chars)
>           assert S[-1] not in set(strip_chars)
E           assert '1' not in {'1'}
E            +  where {'1'} = set('1')

test_code.py:118: AssertionError
----------------------------------------------------- Hypothesis ------------------------------------------------------
Falsifying example: test_strip_hyp(s='01', strip_chars='1')
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgf34c31d">
<h3 id="orgf34c31d">What is Hypothesis?</h3>
<ul>
<li>a modern implementation of property based testing</li>
<li>Plans for Java/C/C++ version</li>
<li><code>pip install hypothesis</code></li>

</ul>
<aside class="notes">
<ul>
<li>David MacIver</li>
<li>Training</li>
<li>Funding</li>

</ul>

</aside>
</section>
<section id="slide-org2b829e4">
<h4 id="org2b829e4">What does it provide?</h4>
<ul>
<li>Data generation</li>
<li>Test properties &amp; record failures</li>
<li>Shrinking</li>
<li>Configurable</li>

</ul>
<aside class="notes">
<ul>
<li>a bunch of strategies to generate different kinds of data!</li>
<li>Hook up to testing frameworks for asserting properties</li>
<li>recording inputs for failed tests</li>
<li>shrinking them</li>

</ul>

</aside>

</section>
</section>
