pycon-2016-prop-test/property-testing-hypothesis.org
*** Generators for builtins

#+BEGIN_SRC python
  from hypothesis import strategies as st

  def sample(strategy, n=3):
      return [strategy.example() for _ in range(n)]

  print(sample(st.integers()))
  print(sample(st.floats()))
  print(sample(st.complex_numbers()))
  print(sample(st.text(max_size=3)))
  print(sample(st.lists(st.integers())))
#+END_SRC

#+BEGIN_EXAMPLE
  [-7435755662106, -49, -1295624]
  [-9.266256382731017e+17, -0.19780830243100944, -2.4010523231296193e+61]
  [(-0.99999-0.99999j), (-2.220446049250313e-16+nanj), (0.003554608069336136-1.923176004582495e-275j)]
  ['', '\U000ded7f9', '']
  [[52647858669059, -31758544979, 71365626], [0], []]
#+END_EXAMPLE
*** Extra generators
- Django models
- Numpy arrays
- Dates & times
- Faker generators
#+BEGIN_NOTES
- fake factory previously known as
  - provides a bunch of things
  - from credit card numbers to fake addresses to ips
#+END_NOTES
*** Composable strategies
#+BEGIN_SRC python
  from hypothesis import strategies as st

  st.recursive?
  st.builds?
  st.streaming?
  st.one_of?

  .map
  .filter
  .flatmap
#+END_SRC

#+BEGIN_NOTES
- Provides functions to compose basic ones
- recursive data structure/json?
- st.builds? - target()
- st.streaming? - streaming data
- choose from one of the strategies
- generate example, convert that to strategy
#+END_NOTES
*** Composing strategies - Example

#+BEGIN_SRC markdown
  first_name|last_name |gpa
  ----------|----------|---
  John      |Adams     |90
  George    |Washington|67
  Thomas    |Jefferson |50
#+END_SRC

#+BEGIN_NOTES
- Let's try to build a table
- Homework: Exercise for the reader
  - Use ~flatmap~ to improve this
  - Use ~fake factory~ to get names
#+END_NOTES
*** Cells and Rows
#+BEGIN_SRC python
  from hypothesis import strategies as st

  n = 3
  generate_cell = st.one_of(st.integers(), st.text(min_size=1), st.booleans())
  generate_row = st.lists(generate_cell, min_size=n, max_size=n)
  generate_data = st.lists(generate_row, min_size=1)

  generate_headers = st.lists(st.text(min_size=1), unique=True, min_size=n, max_size=n)
#+END_SRC
#+BEGIN_NOTES
- Homework: Exercise for the reader
  - Use ~flatmap~ to improve this
  - Use ~fake factory~ to get names
#+END_NOTES
*** Putting it together
#+BEGIN_SRC python
  def create_dataset(rows, headers):
      return tablib.Dataset(*rows, headers=headers)

  st.builds(create_dataset, generate_data, headers=generate_headers)
#+END_SRC
#+BEGIN_NOTES
- Homework: Exercise for the reader
  - Use ~flatmap~ to improve this
  - Use ~fake factory~ to get names
#+END_NOTES
** Shrinking
- Random data has lots of noise
- Try to find the simplest failing case
To learn more, see [[https://github.com/HypothesisWorks/hypothesis-python/blob/7c54198d31a5035a0c2810d8c500308f507b5b11/notebooks/Designing%2520a%2520better%2520simplifier.ipynb][Designing a better simplifier]]
#+BEGIN_NOTES
- hard to understand why it fails
- may not always be the smallest case
- important to be fast!
#+END_NOTES
*** TODO Example if time??
** Settings
- Can configure
  - max_examples
  - max_iterations
  - max_shrinks
  - verbosity
- Can be configured globally or per-test
- settings profiles -- use different settings for CI/development

*** Per-test config example

#+BEGIN_SRC python
  from hypothesis import given, settings, strategies as st, Verbosity

  @given(st.integers())
  @settings(max_examples=500, verbosity=Verbosity.verbose)
  def test_this_thoroughly(x):
      pass
#+END_SRC
* How-to write properties?
** TODO Incremental transition
- Show roles lib test?

#+BEGIN_SRC python
  def test_permissions_ruleset():
      add_perm('can_edit_book', always_true)
      assert 'can_edit_book' in permissions
      assert perm_exists('can_edit_book')
      assert has_perm('can_edit_book')
      remove_perm('can_edit_book')
      assert not perm_exists('can_edit_book')
#+END_SRC

** TODO Incremental transition 2

#+BEGIN_SRC python
  @given(permission=st.text())
  def test_permissions_ruleset(permission):
      add_perm(permission, always_true)
      assert permission in permissions
      assert perm_exists(permission)
      assert has_perm(permission)
      remove_perm(permission)
      assert not perm_exists(permission)
#+END_SRC

Hypothesis website has an [[http://hypothesis.works/articles/incremental-property-based-testing/][article]]

#+BEGIN_NOTES
- Build incrementally
  - Talk about more changes that could be made
  - special permissions, etc?
- Good properties
  - Fast - both data generation & assertions
  - Simple, don't duplicate code under test
- Thinking about other similar functions which will pass? and come up with
  stronger properties of the code/function/action
- Common design patterns?
#+END_NOTES

** Verification

Assert that a property holds true

- Sorting actually returns a sorted list
- Stripping white space leaves no leading/trailing white space
- Check whether a string split is working
- Computing the mean of a list of numbers

#+BEGIN_NOTES
- Proving result is right is hard without duplicating Code Under Test
- But, checking result is not wrong is easy
#+END_NOTES

