pycon-2016-prop-test/property-testing-hypothesis.html
<section>
<section id="slide-org520f664">
<h3 id="org520f664">Data generation</h3>
<div class="outline-text-3" id="text-org520f664">
</div></section>
<section id="slide-org39932c8">
<h4 id="org39932c8">Generators for builtins</h4>
<div class="org-src-container">

<pre><code class="python" >from hypothesis import strategies as st

def sample(strategy, n=3):
    return [strategy.example() for _ in range(n)]

print(sample(st.integers()))
print(sample(st.floats()))
print(sample(st.complex_numbers()))
print(sample(st.text(max_size=3)))
print(sample(st.lists(st.integers())))
</code></pre>
</div>

<pre class="example">
[-7435755662106, -49, -1295624]
[-9.266256382731017e+17, -0.19780830243100944, -2.4010523231296193e+61]
[(-0.99999-0.99999j), (-2.220446049250313e-16+nanj), (0.003554608069336136-1.923176004582495e-275j)]
['', '\U000ded7f9', '']
[[52647858669059, -31758544979, 71365626], [0], []]
</pre>
</section>
<section id="slide-orgbcf6c0f">
<h4 id="orgbcf6c0f">Extra generators</h4>
<ul>
<li>Django models</li>
<li>Numpy arrays</li>
<li>Dates &amp; times</li>
<li>Faker generators</li>

</ul>
<aside class="notes">
<ul>
<li>fake factory previously known as
<ul>
<li>provides a bunch of things</li>
<li>from credit card numbers to fake addresses to ips</li>

</ul></li>

</ul>

</aside>
</section>
<section id="slide-org2d50048">
<h4 id="org2d50048">Composable strategies</h4>
<div class="org-src-container">

<pre><code class="python" >from hypothesis import strategies as st

st.recursive?
st.builds?
st.streaming?
st.one_of?

.map
.filter
.flatmap
</code></pre>
</div>

<aside class="notes">
<ul>
<li>Provides functions to compose basic ones</li>
<li>recursive data structure/json?</li>
<li>st.builds? - target()</li>
<li>st.streaming? - streaming data</li>
<li>choose from one of the strategies</li>
<li>generate example, convert that to strategy</li>

</ul>

</aside>
</section>
<section id="slide-org8a15892">
<h4 id="org8a15892">Composing strategies - Example</h4>
<div class="org-src-container">

<pre><code class="markdown" >first_name|last_name |gpa
----------|----------|---
John      |Adams     |90
George    |Washington|67
Thomas    |Jefferson |50
</code></pre>
</div>

<aside class="notes">
<ul>
<li>Let's try to build a table</li>
<li>Homework: Exercise for the reader
<ul>
<li>Use <code>flatmap</code> to improve this</li>
<li>Use <code>fake factory</code> to get names</li>

</ul></li>

</ul>

</aside>
</section>
<section id="slide-orgdb44e7b">
<h4 id="orgdb44e7b">Cells and Rows</h4>
<div class="org-src-container">

<pre><code class="python" >from hypothesis import strategies as st

n = 3
generate_cell = st.one_of(st.integers(), st.text(min_size=1), st.booleans())
generate_row = st.lists(generate_cell, min_size=n, max_size=n)
generate_data = st.lists(generate_row, min_size=1)

generate_headers = st.lists(st.text(min_size=1), unique=True, min_size=n, max_size=n)
</code></pre>
</div>
<aside class="notes">
<ul>
<li>Homework: Exercise for the reader
<ul>
<li>Use <code>flatmap</code> to improve this</li>
<li>Use <code>fake factory</code> to get names</li>

</ul></li>

</ul>

</aside>
</section>
<section id="slide-orgff13d04">
<h4 id="orgff13d04">Putting it together</h4>
<div class="org-src-container">

<pre><code class="python" >def create_dataset(rows, headers):
    return tablib.Dataset(*rows, headers=headers)

st.builds(create_dataset, generate_data, headers=generate_headers)
</code></pre>
</div>
<aside class="notes">
<ul>
<li>Homework: Exercise for the reader
<ul>
<li>Use <code>flatmap</code> to improve this</li>
<li>Use <code>fake factory</code> to get names</li>

</ul></li>

</ul>

</aside>
</section>
</section>
<section>
<section id="slide-org0004700">
<h3 id="org0004700">Shrinking</h3>
<ul>
<li>Random data has lots of noise</li>
<li>Try to find the simplest failing case</li>

</ul>
<p>
To learn more, see <a href="https://github.com/HypothesisWorks/hypothesis-python/blob/7c54198d31a5035a0c2810d8c500308f507b5b11/notebooks/Designing%20a%20better%20simplifier.ipynb">Designing a better simplifier</a>
</p>
<aside class="notes">
<ul>
<li>hard to understand why it fails</li>
<li>may not always be the smallest case</li>
<li>important to be fast!</li>

</ul>

</aside>
</section>
<section id="slide-orgf27f114">
<h4 id="orgf27f114"><span class="todo TODO">TODO</span> Example if time??</h4>
</section>
</section>
<section>
<section id="slide-org1feffa5">
<h3 id="org1feffa5">Settings</h3>
<ul>
<li>Can configure
<ul>
<li>max_examples</li>
<li>max_iterations</li>
<li>max_shrinks</li>
<li>verbosity</li>

</ul></li>
<li>Can be configured globally or per-test</li>
<li>settings profiles &#x2013; use different settings for CI/development</li>

</ul>

</section>
<section id="slide-orgb03c07e">
<h4 id="orgb03c07e">Per-test config example</h4>
<div class="org-src-container">

<pre><code class="python" >from hypothesis import given, settings, strategies as st, Verbosity

@given(st.integers())
@settings(max_examples=500, verbosity=Verbosity.verbose)
def test_this_thoroughly(x):
    pass
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org5e9041f">
<h2 id="org5e9041f">How-to write properties?</h2>
<div class="outline-text-2" id="text-org5e9041f">
</div></section>
</section>
<section>
<section id="slide-org0f7bd4f">
<h3 id="org0f7bd4f"><span class="todo TODO">TODO</span> Incremental transition</h3>
<ul>
<li>Show roles lib test?</li>

</ul>

<div class="org-src-container">

<pre><code class="python" >def test_permissions_ruleset():
    add_perm('can_edit_book', always_true)
    assert 'can_edit_book' in permissions
    assert perm_exists('can_edit_book')
    assert has_perm('can_edit_book')
    remove_perm('can_edit_book')
    assert not perm_exists('can_edit_book')
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org9d6a78c">
<h3 id="org9d6a78c"><span class="todo TODO">TODO</span> Incremental transition 2</h3>
<div class="org-src-container">

<pre><code class="python" >@given(permission=st.text())
def test_permissions_ruleset(permission):
    add_perm(permission, always_true)
    assert permission in permissions
    assert perm_exists(permission)
    assert has_perm(permission)
    remove_perm(permission)
    assert not perm_exists(permission)
</code></pre>
</div>

<p>
Hypothesis website has an <a href="http://hypothesis.works/articles/incremental-property-based-testing/">article</a>
</p>

<aside class="notes">
<ul>
<li>Build incrementally
<ul>
<li>Talk about more changes that could be made</li>
<li>special permissions, etc?</li>

</ul></li>
<li>Good properties
<ul>
<li>Fast - both data generation &amp; assertions</li>
<li>Simple, don't duplicate code under test</li>

</ul></li>
<li>Thinking about other similar functions which will pass? and come up with
stronger properties of the code/function/action</li>
<li>Common design patterns?</li>

</ul>

</aside>

</section>
</section>
<section>
<section id="slide-orgf7daae4">
<h3 id="orgf7daae4">Verification</h3>
<p>
Assert that a property holds true
</p>

<ul>
<li>Sorting actually returns a sorted list</li>
<li>Stripping white space leaves no leading/trailing white space</li>
<li>Check whether a string split is working</li>
<li>Computing the mean of a list of numbers</li>

</ul>

<aside class="notes">
<ul>
<li>Proving result is right is hard without duplicating Code Under Test</li>
<li>But, checking result is not wrong is easy</li>

</ul>

</aside>

</section>
