pycon-2016-prop-test/property-testing-hypothesis.org
*** Computing the mean
#+BEGIN_SRC python
  from hypothesis import given, strategies as st

  @given(st.lists(st.floats(allow_nan=False, allow_infinity=False)), min_size=1)
  def test_mean_is_within_reasonable_bounds(ls):
      assert min(ls) <= mean(ls) <= max(ls)
#+END_SRC

#+BEGIN_NOTES
Looks like a very dumb test, but isn't really...
#+END_NOTES

#+REVEAL: split

Going by definition ...
#+BEGIN_SRC python
  def mean(xs):
      return sum(xs) / len(xs)
#+END_SRC

#+BEGIN_EXAMPLE
  ls = [8.988465674311579e+307, 8.98846567431158e+307]

      @given(st.lists(st.floats(allow_nan=False, allow_infinity=False), min_size=1))
      def test_mean_is_within_reasonable_bounds(ls):
  >       assert min(ls) <= mean(ls) <= max(ls)
  E       assert inf <= 8.98846567431158e+307
  E        +  where inf = mean([8.988465674311579e+307, 8.98846567431158e+307])
  E        +  and   8.98846567431158e+307 = max([8.988465674311579e+307, 8.98846567431158e+307])

#+END_EXAMPLE

#+BEGIN_NOTES
Overflow!
#+END_NOTES

#+REVEAL: split

Avoiding overflow
#+BEGIN_SRC python
  def mean(xs):
      n = len(xs)
      return sum(x / n  for x in xs)
#+END_SRC

#+BEGIN_EXAMPLE
  ls = [1.390671161567e-309, 1.390671161567e-309, 1.390671161567e-309]

      @given(st.lists(st.floats(allow_nan=False, allow_infinity=False), min_size=1))
      def test_mean_is_within_reasonable_bounds(ls):
  >       assert min(ls) <= mean(ls) <= max(ls)
  E       assert 1.390671161567e-309 <= 1.390671161566996e-309
  E        +  where 1.390671161567e-309 = min([1.390671161567e-309, 1.390671161567e-309, 1.390671161567e-309])
  E        +  and   1.390671161566996e-309 = mean([1.390671161567e-309, 1.390671161567e-309, 1.390671161567e-309])
#+END_EXAMPLE

#+BEGIN_NOTES
Inaccurate!
#+END_NOTES

#+REVEAL: split

For instance, ~numpy~
#+BEGIN_SRC python
  import numpy as np
  def mean(xs):
      return np.array(xs).mean()
#+END_SRC

#+BEGIN_EXAMPLE
  ls = [8.988465674311579e+307, 8.98846567431158e+307]

      @given(st.lists(st.floats(allow_nan=False, allow_infinity=False), min_size=1))
      def test_mean_is_within_reasonable_bounds(ls):
  >       assert min(ls) <= mean(ls) <= max(ls)
  E       assert inf <= 8.98846567431158e+307
  E        +  where inf = mean([8.988465674311579e+307, 8.98846567431158e+307])
  E        +  and   8.98846567431158e+307 = max([8.988465674311579e+307, 8.98846567431158e+307])
#+END_EXAMPLE

Read this [[https://hal.archives-ouvertes.fr/file/index/docid/576641/filename/computing-midpoint.pdf][30 page paper]], to see how to do it right!

#+BEGIN_NOTES
- Floating points are hard!
- Even a lax constraint catches bugs
- Layer more tests on this
- Courtesy: Hypothesis [[http://hypothesis.works/articles/calculating-the-mean/][blog post]]
#+END_NOTES
** Round trip
There and back again

- Encode-decode invariance
- Reversing a reversed list

#+BEGIN_SRC python
  from hypothesis import given, strategies as st

  def reverse(ls):
      return ls[::-1]

  @given(st.lists(st.integers()))
  def test_reversing_reversed_list(ls):
      assert ls == reverse(reverse(ls))
#+END_SRC

#+REVEAL: split

[[https://www.youtube.com/watch?v=jvwfDdgg93E][Matt Bacchman]] talks about a dateutil bug in his talk

#+BEGIN_SRC python
  import datetime
  import dateutil

  datetime(99, 1, 1, 0, 0).isoformat()   # '0099-01-01T00:00:00'
  dateutil.parse('0099-01-01T00:00:00')  # datetime.datetime(1999, 1, 1, 0, 0)
#+END_SRC

#+BEGIN_NOTES
- Couple of bug in Mercurial
- http://hypothesis.works/articles/encode-decode-invariant/
#+END_NOTES

** Idempotence

Already been done!

- Sorting a list
- Rounding a number
- PUT and DELETE should be idempotent
- captialize/upper/lower/strip a string

#+BEGIN_SRC python
  from hypothesis import strategies as st, given

  @given(st.lists(st.integers()))
  def test_sort_idempotence(xs):
      assert sorted(xs) == sorted(sorted(xs))

  @given(st.text())
  def test_text_idempotence(s):
      assert s.upper() == s.upper().upper()
      assert s.lower() == s.lower().lower()
      assert s.capitalize() == s.capitalize().capitalize()
#+END_SRC

#+BEGIN_NOTES
- Standard requires PUT, DELETE and safe request methods to be idempotent
- Anything functional is idempotent, yeah?
#+END_NOTES
** Invariance

Some things never change.

- Sorting or reversing shouldn't change
  - length of list
  - elements of the list

#+BEGIN_SRC python
  from hypothesis import given, strategies as st
  from collections import Counter

  def reverse(ls):
      return ls[::-1]

  @given(st.lists(st.integers()))
  def test_sorting_invariance(ls):
      assert Counter(ls) == Counter(sorted(ls))

  @given(st.lists(st.integers()))
  def test_reversing_invariance(ls):
      assert Counter(ls) == Counter(reverse(ls))

#+END_SRC

#+BEGIN_NOTES
- What are the invariants?
#+END_NOTES

** Transformation

Different paths, same destination

*** List reversing

#+BEGIN_SRC python
  from hypothesis import given, strategies as st
  def reverse(ls):
      return ls[::-1]

  @given(st.lists(st.integers()), st.integers())
  def test_list_reverse_transformation(xs, x):
      assert reverse(xs + [x]) == [x] + reverse(xs)
#+END_SRC

*** Change text to uppercase
#+BEGIN_SRC python
  from string import ascii_uppercase
  from hypothesis import given, strategies as st


  @given(st.text(), st.text(alphabet=ascii_uppercase))
  def test_uppercase_transformation(text, upper_suffix):
      assert text.upper() + upper_suffix == (text + upper_suffix).upper()
#+END_SRC

** Induction

Solve a smaller problem first

#+BEGIN_SRC python
  from hypothesis import given, strategies as st

  def is_sorted(ls):
      return True if len(ls) <= 1 else ls[0] <= ls[1] and is_sorted(ls[1:])

  @given(st.lists(st.integers()))
  def test_list_sorting(xs):
      assert is_sorted(sorted(xs))
#+END_SRC

** Test Oracle

Use existing code to test new code

- Optimizing
- Refactoring

#+BEGIN_SRC python
  from hypothesis import strategies as st, given
  from my_lib import my_sort

  @given(st.lists(st.integers()))
  def test_my_sort(xs):
      assert sorted(xs) == my_sort(xs)
#+END_SRC

#+BEGIN_NOTES
- Too slow
- Hard to parallelize
- Whatever other reason for refactoring
#+END_NOTES

** TODO Think about re-usability of properties
*** And simplicity of properties
- Caution against power of property even if the look trivial
- Re-usable properties!
- keep them simple or you might have to test your properties code!

* TODO Stateful testing??
- Testing against a model
- State diagram is mind blowing
- Reproduce user reports
- Tricky concurrent bugs
** TODO Example - 1
Rules test

** TODO Example - 2
tablib test, more - add row, remove row, sort, ...
* TODO Common pitfalls
