pycon-2016-prop-test/property-testing-hypothesis.html
<section id="slide-org96b9b0d">
<h4 id="org96b9b0d">Computing the mean</h4>
<div class="org-src-container">

<pre><code class="python" >from hypothesis import given, strategies as st

@given(st.lists(st.floats(allow_nan=False, allow_infinity=False)), min_size=1)
def test_mean_is_within_reasonable_bounds(ls):
    assert min(ls) <= mean(ls) <= max(ls)
</code></pre>
</div>

<aside class="notes">
<p>
Looks like a very dumb test, but isn't really&#x2026;
</p>

</aside>

</section>
<section>

<p>
Going by definition &#x2026;
</p>
<div class="org-src-container">

<pre><code class="python" >def mean(xs):
    return sum(xs) / len(xs)
</code></pre>
</div>

<pre class="example">
ls = [8.988465674311579e+307, 8.98846567431158e+307]

    @given(st.lists(st.floats(allow_nan=False, allow_infinity=False), min_size=1))
    def test_mean_is_within_reasonable_bounds(ls):
&gt;       assert min(ls) &lt;= mean(ls) &lt;= max(ls)
E       assert inf &lt;= 8.98846567431158e+307
E        +  where inf = mean([8.988465674311579e+307, 8.98846567431158e+307])
E        +  and   8.98846567431158e+307 = max([8.988465674311579e+307, 8.98846567431158e+307])
</pre>

<aside class="notes">
<p>
Overflow!
</p>

</aside>

</section>
<section>

<p>
Avoiding overflow
</p>
<div class="org-src-container">

<pre><code class="python" >def mean(xs):
    n = len(xs)
    return sum(x / n  for x in xs)
</code></pre>
</div>

<pre class="example">
ls = [1.390671161567e-309, 1.390671161567e-309, 1.390671161567e-309]

    @given(st.lists(st.floats(allow_nan=False, allow_infinity=False), min_size=1))
    def test_mean_is_within_reasonable_bounds(ls):
&gt;       assert min(ls) &lt;= mean(ls) &lt;= max(ls)
E       assert 1.390671161567e-309 &lt;= 1.390671161566996e-309
E        +  where 1.390671161567e-309 = min([1.390671161567e-309, 1.390671161567e-309, 1.390671161567e-309])
E        +  and   1.390671161566996e-309 = mean([1.390671161567e-309, 1.390671161567e-309, 1.390671161567e-309])
</pre>

<aside class="notes">
<p>
Inaccurate!
</p>

</aside>

</section>
<section>

<p>
For instance, <code>numpy</code>
</p>
<div class="org-src-container">

<pre><code class="python" >import numpy as np
def mean(xs):
    return np.array(xs).mean()
</code></pre>
</div>

<pre class="example">
ls = [8.988465674311579e+307, 8.98846567431158e+307]

    @given(st.lists(st.floats(allow_nan=False, allow_infinity=False), min_size=1))
    def test_mean_is_within_reasonable_bounds(ls):
&gt;       assert min(ls) &lt;= mean(ls) &lt;= max(ls)
E       assert inf &lt;= 8.98846567431158e+307
E        +  where inf = mean([8.988465674311579e+307, 8.98846567431158e+307])
E        +  and   8.98846567431158e+307 = max([8.988465674311579e+307, 8.98846567431158e+307])
</pre>

<p>
Read this <a href="https://hal.archives-ouvertes.fr/file/index/docid/576641/filename/computing-midpoint.pdf">30 page paper</a>, to see how to do it right!
</p>

<aside class="notes">
<ul>
<li>Floating points are hard!</li>
<li>Even a lax constraint catches bugs</li>
<li>Layer more tests on this</li>
<li>Courtesy: Hypothesis <a href="http://hypothesis.works/articles/calculating-the-mean/">blog post</a></li>

</ul>

</aside>
</section>
</section>
<section>
<section id="slide-orge7f14a0">
<h3 id="orge7f14a0">Round trip</h3>
<p>
There and back again
</p>

<ul>
<li>Encode-decode invariance</li>
<li>Reversing a reversed list</li>

</ul>

<div class="org-src-container">

<pre><code class="python" >from hypothesis import given, strategies as st

def reverse(ls):
    return ls[::-1]

@given(st.lists(st.integers()))
def test_reversing_reversed_list(ls):
    assert ls == reverse(reverse(ls))
</code></pre>
</div>

</section>
<section>

<p>
<a href="https://www.youtube.com/watch?v=jvwfDdgg93E">Matt Bacchman</a> talks about a dateutil bug in his talk
</p>

<div class="org-src-container">

<pre><code class="python" >import datetime
import dateutil

datetime(99, 1, 1, 0, 0).isoformat()   # '0099-01-01T00:00:00'
dateutil.parse('0099-01-01T00:00:00')  # datetime.datetime(1999, 1, 1, 0, 0)
</code></pre>
</div>

<aside class="notes">
<ul>
<li>Couple of bug in Mercurial</li>
<li><a href="http://hypothesis.works/articles/encode-decode-invariant/">http://hypothesis.works/articles/encode-decode-invariant/</a></li>

</ul>

</aside>

</section>
</section>
<section>
<section id="slide-org5326863">
<h3 id="org5326863">Idempotence</h3>
<p>
Already been done!
</p>

<ul>
<li>Sorting a list</li>
<li>Rounding a number</li>
<li>PUT and DELETE should be idempotent</li>
<li>captialize/upper/lower/strip a string</li>

</ul>

<div class="org-src-container">

<pre><code class="python" >from hypothesis import strategies as st, given

@given(st.lists(st.integers()))
def test_sort_idempotence(xs):
    assert sorted(xs) == sorted(sorted(xs))

@given(st.text())
def test_text_idempotence(s):
    assert s.upper() == s.upper().upper()
    assert s.lower() == s.lower().lower()
    assert s.capitalize() == s.capitalize().capitalize()
</code></pre>
</div>

<aside class="notes">
<ul>
<li>Standard requires PUT, DELETE and safe request methods to be idempotent</li>
<li>Anything functional is idempotent, yeah?</li>

</ul>

</aside>
</section>
</section>
<section>
<section id="slide-org7d2e5a9">
<h3 id="org7d2e5a9">Invariance</h3>
<p>
Some things never change.
</p>

<ul>
<li>Sorting or reversing shouldn't change
<ul>
<li>length of list</li>
<li>elements of the list</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre><code class="python" >from hypothesis import given, strategies as st
from collections import Counter

def reverse(ls):
    return ls[::-1]

@given(st.lists(st.integers()))
def test_sorting_invariance(ls):
    assert Counter(ls) == Counter(sorted(ls))

@given(st.lists(st.integers()))
def test_reversing_invariance(ls):
    assert Counter(ls) == Counter(reverse(ls))
</code></pre>
</div>

<aside class="notes">
<ul>
<li>What are the invariants?</li>

</ul>

</aside>

</section>
</section>
<section>
<section id="slide-org888d000">
<h3 id="org888d000">Transformation</h3>
<p>
Different paths, same destination
</p>

</section>
<section id="slide-orgd6cb598">
<h4 id="orgd6cb598">List reversing</h4>
<div class="org-src-container">

<pre><code class="python" >from hypothesis import given, strategies as st
def reverse(ls):
    return ls[::-1]

@given(st.lists(st.integers()), st.integers())
def test_list_reverse_transformation(xs, x):
    assert reverse(xs + [x]) == [x] + reverse(xs)
</code></pre>
</div>

</section>
<section id="slide-orga18d4a5">
<h4 id="orga18d4a5">Change text to uppercase</h4>
<div class="org-src-container">

<pre><code class="python" >from string import ascii_uppercase
from hypothesis import given, strategies as st


@given(st.text(), st.text(alphabet=ascii_uppercase))
def test_uppercase_transformation(text, upper_suffix):
    assert text.upper() + upper_suffix == (text + upper_suffix).upper()
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org812bf37">
<h3 id="org812bf37">Induction</h3>
<p>
Solve a smaller problem first
</p>

<div class="org-src-container">

<pre><code class="python" >from hypothesis import given, strategies as st

def is_sorted(ls):
    return True if len(ls) <= 1 else ls[0] <= ls[1] and is_sorted(ls[1:])

@given(st.lists(st.integers()))
def test_list_sorting(xs):
    assert is_sorted(sorted(xs))
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org819ada2">
<h3 id="org819ada2">Test Oracle</h3>
<p>
Use existing code to test new code
</p>

<ul>
<li>Optimizing</li>
<li>Refactoring</li>

</ul>

<div class="org-src-container">

<pre><code class="python" >from hypothesis import strategies as st, given
from my_lib import my_sort

@given(st.lists(st.integers()))
def test_my_sort(xs):
    assert sorted(xs) == my_sort(xs)
</code></pre>
</div>

<aside class="notes">
<ul>
<li>Too slow</li>
<li>Hard to parallelize</li>
<li>Whatever other reason for refactoring</li>

</ul>

</aside>

</section>
</section>
<section>
<section id="slide-org8e6ac6e">
<h3 id="org8e6ac6e"><span class="todo TODO">TODO</span> Think about re-usability of properties</h3>
<div class="outline-text-3" id="text-org8e6ac6e">
</div></section>
<section id="slide-org012e405">
<h4 id="org012e405">And simplicity of properties</h4>
<ul>
<li>Caution against power of property even if the look trivial</li>
<li>Re-usable properties!</li>
<li>keep them simple or you might have to test your properties code!</li>

</ul>

</section>
</section>
<section>
<section id="slide-org250da45">
<h2 id="org250da45"><span class="todo TODO">TODO</span> Stateful testing??</h2>
<ul>
<li>Testing against a model</li>
<li>State diagram is mind blowing</li>
<li>Reproduce user reports</li>
<li>Tricky concurrent bugs</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgcb24da5">
<h3 id="orgcb24da5"><span class="todo TODO">TODO</span> Example - 1</h3>
<p>
Rules test
</p>

</section>
</section>
<section>
<section id="slide-org0659c02">
<h3 id="org0659c02"><span class="todo TODO">TODO</span> Example - 2</h3>
<p>
tablib test, more - add row, remove row, sort, &#x2026;
</p>
</section>
</section>
<section>
<section id="slide-orgc021a84">
<h2 id="orgc021a84"><span class="todo TODO">TODO</span> Common pitfalls</h2>
<div class="outline-text-2" id="text-orgc021a84">
</div></section>
</section>
